{"/docs/":{"data":{"":"test or whatever?"},"title":"Docs"},"/docs/ai-monitoring/":{"data":{"":"test or whatever?"},"title":"Monitoring for AI apps"},"/docs/ai-monitoring/install-aim/":{"data":{"":"","#":"When you install AI monitoring, you’re allowing our APM agents to collect metrics and event data from AI libraries and frameworks. To get started, you’ll instrument your AI-powered app with an APM agent, then update configurations to adjust the agent’s behavior.\nInstall the agent\rFollow our standard install procedures in our Node.js installation doc, then return to this doc to configure your agent.\nConfigure the Node.js agent\rTo collect AI data, you need to set certain configurations to enable AI monitoring. We recommend applying these configurations in newrelic.js, but if you have a more complex set up with multiple environments, you can configure with environment variables.\nConfigure through newrelic.js\rai_monitoring.enabled = true span_events.max_samples_stored = 10000 custom_insights_events.max_samples_stored = 100000\rConfigure with environment variables\rNEW_RELIC_AI_MONITORING_ENABLED = TRUE\rNEW_RELIC_SPAN_EVENTS_MAX_SAMPLES_STORED = 10000\rNEW_RELIC_CUSTOM_INSIGHTS_EVENTS_MAX_SAMPLES_STORED = 100000\rView your data\rTrigger an event in your system, wait a few minutes, then check New Relic for your data. You can find your AI data by going to one.newrelic.com \u003e AI monitoring \u003e AI responses."},"title":"Install monitoring for AI"},"/docs/ai-monitoring/intro-aim/":{"data":{"":"","get-started-with-ai-monitoring#Get started with AI monitoring":"AI monitoring is our solution for application monitoring (APM) for AI. When you enable AI monitoring, our APM agents can give you end-to-end visibility into performance, cost, and quality of supported models from vendors like OpenAI and BedRock. Explore how users interact with an AI assistant, dig into trace-level details about a model’s response to an AI event, and compare the performance of different models across app environments.\nHow does AI monitoring work?\rTo get started with AI monitoring, you’ll instrument your AI-powered app with one of our APM agents. Once you’ve instrumented your app, you can enable AI monitoring so the agent can capture LLM observability data.\nWhen your AI assistant receives a prompt and returns a response, the agent captures metric and event data generated from external LLMs and vector stores. Our agent can:\nParse information about completion, prompt, and response tokens Track requests and responses that pass through any of our supported models Correlate negative or positive feedback about a response from your end users You can access all this information and more from the New Relic platform, then create alerts and dashboards to help you effectively manage your AI data and improve performance.\nImprove AI performance with AI monitoring\rAI monitoring can help you answer critical questions about AI app performance: are your end users waiting too long for a response? Is there a recent spike in token usage? Are there patterns of negative user feedback around certain topics? With AI monitoring, you can see data specific to the AI-layer:\nIdentify errors in specific prompt and response interactions from the response table. If you’re looking to make improvements to your AI models, learn how to analyze your model with trace-level data. If you’re using different models across app environments, you can compare the cost and performance of your apps before deploying. Are you concerned about data compliance? Learn how to create drop filters to drop sensitive data before you send it to New Relic. Get started with AI monitoring\rReady to get started? Make sure to confirm that you can instrument your AI library or framework. You may need to update the agent if you’ve already instrumented your app.\nWhen you’re ready, use our doc to manually install AI monitoring. This doc directs you to the relevant procedures for installing an APM agent, then walks you through configuring the agent for AI monitoring.","how-does-ai-monitoring-work#How does AI monitoring work?":"","improve-ai-performance-with-ai-monitoring#Improve AI performance with AI monitoring":""},"title":"Introduction to monitoring for AI"},"/docs/api/":{"data":{"":"test or whatever?"},"title":"API placeholder"},"/docs/aws/":{"data":{"":"test or whatever?"},"title":"Integrate with AWS"},"/docs/getting-started/":{"data":{"":"","context-here#Context here":"","context-here-1#Context here":"","context-here-2#Context here":"INTRO CONTENT HERE\nContext here\rlink\nContext here\rlink\nContext here\rlink"},"title":"Start here"},"/docs/infra-monitoring/":{"data":{"":"test or whatever?"},"title":"Track your infra resources"},"/resume/":{"data":{"":"\rPrevious\rNext    \r/ [pdf]\rView the PDF file here."},"title":"resume"}}